# xCoordinates=32
# yCoordinates=40
startCoordinates=1640 #32*50+40
str="ч В ф ф О И щ В Г Я К Щ П у Г . Ъ З Ъ З Щ Т о п к з Ж . б л | с Я ж ф И Ю ! Д Л б Н Ъ Ц д А Ц М я а
я Л ъ И л ! г т Ч З х ц Р о П И ь с Е ъ д П Ж й щ т С Г Ю з Ь х , у Ч О ю в ж о з ж Е Р Т Б О | ю в
ч | Щ В Ю Д б Е Т Й Щ . ъ Ч м Р л Ю а в ж ц у ! Ч д К п Й Й Й О и Н _ я д т р ю ъ К ф ч | ч З а й п
я б у у з Ч Я и ю д Е с т А Г П Е ъ з З а К Ф Х Я ж Ч Б к Б ю А Д ж с Т Д П ю с | д о щ г Б | л Ж Н
Г | А я Ю К к _ | П Е Х Т Г л Ю ю М ъ ж Щ е а Ч Е у х г ь ц г В ь Й Н й я в З Д о П п В ж Д м М и Ь
В Т Й й Л С Л в а й Т А Н з л а Е ц о м к ю с р О т к ф р щ й я , Б б Н г Ж Ц Щ к Я к т М б | ъ о К
Ц М Ю з Х р к Х я щ Ф з ъ ь я . Я л щ Д Т т Ц У Ж Ф ц ж Л г К е , Р з ц е Д ц п ж щ Ъ Е Е Ц О Л с А
, Л с Ц У Щ б Й З З П С ъ ! Я ц п х л Й Ь Ю щ т Й в Й Ю о е у д м д е Й Х Т г в Ь л С ь в е ! А з М
з а й У ж Р а А П х Ь Х ч Щ О п | о Т В Ъ м Я Ж м р Ч Г д з Я б ! ! Ч . О Ч Ъ Ц ж А Д _ О ! П Д ъ Щ
Ц Ц И Щ И И Д Д р ь У н Д с ъ б Е о е с Х в л й Ф , и Т Я | Г Д | Д р ф ж А Н й и Х _ б у х И ч П Щ
о г О о ф Ф Ч ж х К Е е ь н П Х н Г Х _ к в В и ! Д Б ! м , Ю К . _ _ К Ж л б _ Ъ | И я к Ц Д Г И Ь
т К М Т з Т В б у В _ х В ж Х Ъ . д , Р Х Д щ л А З Щ _ ц у ь Н х й Я я ! А У Б ! З ц ц _ у к , Ь д
я В Ж Г д л Ц ! В А Н Й у е Б й П т _ Ю ю Ю с ь Ъ М в Л Т е С . Ъ Б У Т Щ З п ж с л к Х Щ ч ц Ю , Ф
С Е т Б о , . я Б П л я х П Р Г Ъ Т _ ч п Ъ б О М С В ц а Ч ц ф ! ь л В п п я й Н Я Я а Я Р | ! х Щ
т х г Ъ р Р Л Я в И М з Ж С з Ч Б И я ж С Т е щ А З Т К П , ! Щ а Х О б г А ч ! Ъ М а й т Я У р Й Я
г з е щ З и Х В ! г Ч е Р Щ Ъ , ц е _ к в т ц Ж Н Ж в У т Т Ь В л К У А п ъ х с ж в м Е Ж ь О Ф ! У
Н Х м Й я К ф ж Щ к Ф О ч П Я Н Р К ж ь ! Ч е Н о а Б С м Х Ь о Ч а щ У ь в О П Ь Х И Л к щ С | й л
! Ь г п П б Р а Ц е л я у у б в Ъ Ф Ц н х д Ч а Ю а а в д ч д И щ ъ Ъ | ф б о а х к ! ж р Ю ! Д Я Ф
н р у Ф Б , Н л ! , в П о Л Г л а Й т в б н ь ч , т Й ч Е Р Д ! , С Е Ю г А | н щ Ь Т Б л п Е е л х
О щ е Ч Л И м ц д и У Е о С х Ж И П Г т и С б Б в ж Г Г з д т х д с Ю Ъ Ф К З м ч Т с ! ь й Б д З щ
Х Ф й Я н У щ п И т м В П н Б ю Щ ь Х Ц с , С _ ь м а Ъ Т п Ь ф И Ъ л Р о Х к з И н Т Ж с г п п п д
и ь Я Т т к Й щ ц м в . ю ч З Ч г _ д Т б П я х ф ь Б я ф ъ Ч Л Щ , Л ь Ж ф щ л , н Ь Ю з Ж П Ч б Ь
Ф . Н п ь З Х г д н в С р Я Ц с Д Г о й Ъ й | Х Ю р й ч А л з О д Л в З Б Т з Р Щ н Д Х С й Ч р К Д
з Я ф п ч т Ж М Г д Ь б Д с Л с Ж в ф х н з _ н и З Т У в ъ ц щ ! Н л р Ф В Ю ! . ! Т ! е т м Щ Е Ф
х | н о д . Ч с _ щ л | Щ б Х й е Д м Ь Ж Р З Ч ф м н Ь ъ х Ъ Е с , к к с , г ц е . Ъ . ц М Ж К а ъ
Ь с Ф к У П л Ч т и А Д л ф я Е х Щ ч Ч ж А и р Ъ л Ъ _ т з ! , у Ц Ъ _ Е Н С г Ф т а _ Т Ъ А О х Ъ
ю Ж О В ц х х п з щ а | Х ь ф й Л б м щ и я о Е ц а щ в Б р п И н ю с Ю С З Л в А я Д п Щ п и з Б ц
Ж ь , Ф Е К ч Ъ Ж Е Щ ! И П к . и ц С Ц у Е ! И Л в л ф Щ е м и ! р з ъ | Щ г К в о д о Ц А _ б л щ
й П Н Ъ н б З У | б б п у Ф л Ь Ъ д т Ч О С Д п ъ ф г о З с | Р Т З ! Ъ ъ Ъ е . т _ к о в л е л и У
ч Д Ф м Ч х р Г и А Ь . р р в Я Б д К Щ ь ь Ю Б Б щ Д о Ц С я Т щ ю Ь В о т О д с д о н а | Щ О к з
М ! Р А Ь в Р М ф Ц ч ф у Й щ ф , К в з Д н Т У х В ь ъ М Й з Л щ Ъ б ж п д щ е У _ п И | т с Е н е
Ф Р С У Б в Х я й о у Ь е Ц Е Щ р б К з и О з я Р н т Й ф А м Т . х р о а ф С й а м С з ъ ч и _ в _
Ь Ч Т В Б в б В о Т И З Т е У б Г Ф Л з я Л Б т Ж Р щ й Ъ Т я ц т Д п Б _ Т и ч Т л о в л Н з с т З
в л ! е Е Ч Д ц К к Е ! Й Б м о Я о л М ь з а В , ю Т О н Ф н ь ж Б Ч Б б в П ъ _ щ р а _ Д ц у р ь
Б и о Й Я | Т Р Б _ ю у У Ж я Н Н Ю ! Г Г Ц Р в О Ф Ъ _ щ Ъ А Ч а . й Я к м ж т с Ъ К ! ч _ , я _ н
ф _ Щ л В Ь Щ и п Ю в и к и щ В С К Т р в Щ п б С Е Н к ! а Ж у ъ Г я Г Л Л Ъ С л С И ь и с н е р о
н к С о Ь Л б П Г к щ Й м Ч Ц ч М п Щ Ю З А Я ц И в т | щ с Г ь Щ ! Е д Ц С Х в Я п Ф ф . т т в о в
Ъ ц И Г а М Я а . б И П ж ф г х а У И ь С ь , З Ъ ф т Е О з Ъ М н Щ | м и у М б П Ч И д к Ю о в ю а
ж у а Г л о ж К Щ З Е . и , Ф Е з ъ Я З в щ у С м Ю ц д ц ф Н С , М У т ц Т О и б Е е н у Е п и , _
| Ь ф , А й д Л в Ф Н л Ч Ь ф П Ф г Б Б л н М , Т л ю К С у г о У о к Ь , С м О Е Ф н н Ц в у Ж | -
Т Ф а ь ! щ п Щ Ь щ Ю с Ю Ю Л ж А г Ч Д Н У ю С е ц Ж , в _ б д З _ ф Ч Т м я И е д ц ъ С н _ д , Ь
я м И ь н Т к В Б Ж А я , ф Н к Х М д А ф З д С ч и ь м С З ю ь г й р П к щ _ Я ъ Ц Н ъ й Й К М ц л
л С Б к т щ г Щ б а Ъ Ч Д ф ! К Г а я ч О н р А С р ю ю и м ъ И П _ Т ж Ф Я О п Ж Н м З З а м . п Ю
Б ц в З ъ А м к н Ж р Ь р Ь з Г Л Д х И Ж ю . б ю а Ц л Ч Ц Л С Т Ь н ь х Д м Й н | Ь _ А Г А с С Ю
. ъ А д _ А А ь я д Е л Х Ч Ь а к т ц в а О е Х к й г , Й П Д Й у ф | Ф к Я Г Ц Н Ф Х ц с к ю а М И
. р , Е Щ в З Ч Л С У _ в о Т Ч , й с Ж И б у К м ! н ! ж Й т х Г ь У И Ь У З б ч Ж г п ж К Х К П !
Ч З С к ч ф У Б Г Ъ щ м ъ Щ х З й ь й Ч А Ь з Д К с й Ъ ж ц у Й б я ч ю Ф у Ъ П р п Р х О , т ь ! ь
Т с Й ъ ю ю в е Т щ Т ! з А Я Й н Н Т П Ь Х В Н Й в н Б в Г Ю Ц к м К г щ Г я г у п И Ю Ъ ж Ъ Ч ч б
Ч Я Ь Г , б Д л З У о ж Ч С Р з о Б ! | О ь Х Х Ч Ъ Ж р Б р ж п о н ь и я ю Ю м Ю Щ к С С а ь С , ь
Х с р и м Ф Х Ъ А О Щ ч К б У ц Ю ь д М О д р Б Д е Я Р У ъ Г З х Ч щ ж ф м г г Щ Ь ! в р б е щ Б ф".split(' ')
Nagore=1 #-50
Nadolu=2 #+50
Nadqsno=3 #+1
Nalqvo=4 #-1
arr=[1,3,1,3,1,4,1,4,1,3,1,1,3,
    3,2,2,4,2,3,3,2,2,4,2,2,4,2,
    3,3,1,1,3,3,1,4,1,3,1,1,1,
    3,2,3,2,2,2,3,2,4,4,2,3,2,
    4,2,3,3,2,2,2,2,2,4,4,1,1,4,
    1,3,3,1,4,4,1,4,4,2,3,2,4]
Size=arr.size()
i=0
puts str[1640]
Size.times do
    if arr[i]==1
        puts"#{str[startCoordinates-50]}"
        startCoordinates-=50
    end
    if arr[i]==2
        puts"#{str[startCoordinates+50]}"
        startCoordinates+=50
    end
    if arr[i]==3
        puts"#{str[startCoordinates+1]}"
        startCoordinates+=1
    end
    if arr[i]==4
        puts"#{str[startCoordinates-1]}"
        startCoordinates-=1
    end    
    i+=1
end    
